tutorials/icoFsiElasticNonLinULSolidFoam/HronTurekFsi/fluid/constant/couplingProperties
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.3                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          couplingProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solidPatch plate;
solidZone plateZone;


fluidPatch plate;
fluidZone plateZone;

//movingRegion region0;

fsiRelaxationFactor 0.01;

interfaceDeformationLimit 0.01;

outerCorrTolerance 1e-4;

couplingScheme Aitken;

fsi yes;

// ************************************************************************* //
