tutorials/icoFsiElasticNonLinULSolidFoam/HronTurekFsi/fluid/constant/dynamicMeshDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.3                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          motionProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh   dynamicMotionSolverFvMesh;

twoDMotion      yes;

//solver          velocityLaplacian;

solver          laplaceFaceDecomposition;

diffusivity quadratic inverseDistance 1(plate);

frozenDiffusion yes;

distancePatches 
(
    plate
);

// ************************************************************************* //
